In [4]:
import pandas as pd
import numpy as np

In [13]:
d={"aa":["radha","None","virat",'Kartik'],"bb":[10,20,None,40],"cc":[50.34,None,78.90,50.23],"dd":[1000,2000,3000,4000]}
df=pd.DataFrame(d)
df

       aa    bb     cc    dd
0   radha  10.0  50.34  1000
1    None  20.0    NaN  2000
2   virat   NaN  78.90  3000
3  Kartik  40.0  50.23  4000

In [14]:
df.columns=["aa","bb","cc","dd"]

In [15]:
df

       aa    bb     cc    dd
0   radha  10.0  50.34  1000
1    None  20.0    NaN  2000
2   virat   NaN  78.90  3000
3  Kartik  40.0  50.23  4000

In [21]:
df.rename(columns={"aa":"a","bb":"b","cc":"c"},inplace = True )

In [23]:
df

        a     b      c    dd
0   radha  10.0  50.34  1000
1    None  20.0    NaN  2000
2   virat   NaN  78.90  3000
3  Kartik  40.0  50.23  4000

In [25]:
df.dropna(axis=0) # delete all row with None value

        a     b      c    dd
0   radha  10.0  50.34  1000
3  Kartik  40.0  50.23  4000

In [27]:
df.dropna(axis=1)  # delete all columns having None value

        a    dd
0   radha  1000
1    None  2000
2   virat  3000
3  Kartik  4000

In [29]:
df

        a     b      c    dd
0   radha  10.0  50.34  1000
1    None  20.0    NaN  2000
2   virat   NaN  78.90  3000
3  Kartik  40.0  50.23  4000

In [28]:
df.fillna(0)

        a     b      c    dd
0   radha  10.0  50.34  1000
1    None  20.0   0.00  2000
2   virat   0.0  78.90  3000
3  Kartik  40.0  50.23  4000

In [32]:
df.fillna(df["dd"].mean())

        a       b        c    dd
0   radha    10.0    50.34  1000
1    None    20.0  2500.00  2000
2   virat  2500.0    78.90  3000
3  Kartik    40.0    50.23  4000

In [35]:
#df.fillna(df.loc[1].mean())

In [37]:
df["b"].isnull()#check wheather row contain none value or not

0    False
1    False
2     True
3    False
Name: b, dtype: bool

In [40]:
df.loc[1,"b"]

20.0

In [41]:
df.loc[1,"a"]

'None'

In [42]:
pd.isnull(df.loc[1,"c"]) # to check for a single value

True

In [43]:
df.replace({50:100}) #it will replace all 50 in data frame by 100

        a     b      c    dd
0   radha  10.0  50.34  1000
1    None  20.0    NaN  2000
2   virat   NaN  78.90  3000
3  Kartik  40.0  50.23  4000

In [44]:
exam_data  = {'name': ['Sonu', 'Raja', 'Ketaki', 'Rupa', 'Radha', 'Reshma', 'Keshav', 'Narendra', 'Rani', 'Kittu'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)

In [45]:
df

       name  score  attempts qualify
a      Sonu   12.5         1     yes
b      Raja    9.0         3      no
c    Ketaki   16.5         2     yes
d      Rupa    NaN         3      no
e     Radha    9.0         2      no
f    Reshma   20.0         3     yes
g    Keshav   14.5         1     yes
h  Narendra    NaN         1      no
i      Rani    8.0         2      no
j     Kittu   19.0         1     yes

In [46]:
df.replace({'yes': True , 'no':False})

       name  score  attempts  qualify
a      Sonu   12.5         1     True
b      Raja    9.0         3    False
c    Ketaki   16.5         2     True
d      Rupa    NaN         3    False
e     Radha    9.0         2    False
f    Reshma   20.0         3     True
g    Keshav   14.5         1     True
h  Narendra    NaN         1    False
i      Rani    8.0         2    False
j     Kittu   19.0         1     True

In [50]:
d={"id":[1,2,3],"name":["Kartik","Shivam","Rakesh"]}
d1={"id":[1,2,4],"age":[21,22,23]}
df=pd.DataFrame(d)
df1=pd.DataFrame(d1)
print(df)
print(df1)

   id    name
0   1  Kartik
1   2  Shivam
2   3  Rakesh
   id  age
0   1   21
1   2   22
2   4   23

In [51]:
pd.merge(df,df1,on="id")

   id    name  age
0   1  Kartik   21
1   2  Shivam   22

In [52]:
pd.merge(df,df1,on='id',how='right')

   id    name  age
0   1  Kartik   21
1   2  Shivam   22
2   4     NaN   23

In [54]:
pd.merge(df,df1,on='id',how='left')

   id    name   age
0   1  Kartik  21.0
1   2  Shivam  22.0
2   3  Rakesh   NaN

In [55]:
pd.merge(df,df1,on='id',how='outer')

   id    name   age
0   1  Kartik  21.0
1   2  Shivam  22.0
2   3  Rakesh   NaN
3   4     NaN  23.0

In [56]:
pd.merge(df,df1,on='id',how='inner')

   id    name  age
0   1  Kartik   21
1   2  Shivam   22